{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_init_scale", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "Constant_vggatrousextractor2_init_scale_140241085932752", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 3, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_multicast", 
      "name": "vggatrousextractor2_amp_multicast0", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "vggatrousextractor2_broadcast_mul0", 
      "inputs": [[2, 0, 0], [2, 1, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 3, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[5, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[4, 0, 0], [6, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv1_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv1_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(64,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv1_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[11, 0, 0], [13, 0, 0], [15, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[16, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "vggatrousextractor2_pooling0", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[17, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv2_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv2_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 64, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv2_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv2_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv2_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[22, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv2_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[19, 0, 0], [21, 0, 0], [23, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu2_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[24, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv3_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv3_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 128, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv3_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv3_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv3_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[29, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv3_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[26, 0, 0], [28, 0, 0], [30, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu3_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "vggatrousextractor2_pooling1", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[32, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv4_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv4_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 128, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv4_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[35, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv4_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv4_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[37, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv4_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[34, 0, 0], [36, 0, 0], [38, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu4_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv5_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv5_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 256, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv5_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[42, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv5_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv5_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[44, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv5_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[41, 0, 0], [43, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu5_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[46, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv6_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv6_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 256, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv6_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv6_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv6_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv6_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [50, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu6_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[53, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "vggatrousextractor2_pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[54, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv7_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv7_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 256, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv7_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv7_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv7_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv7_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[56, 0, 0], [58, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu7_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[61, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv8_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[62, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv8_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv8_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[64, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv8_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv8_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[66, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv8_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[63, 0, 0], [65, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu8_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv9_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[69, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv9_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv9_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv9_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv9_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[73, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv9_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[70, 0, 0], [72, 0, 0], [74, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu9_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[75, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_normalize0_amp_cast0", 
      "attrs": {"dtype": "float32"}, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "L2Normalization", 
      "name": "vggatrousextractor2_normalize0_l2normalization0", 
      "attrs": {
        "eps": "1e-05", 
        "mode": "channel"
      }, 
      "inputs": [[77, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_normalize0_normalize_scale", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"constant\", {\"value\": 20}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1, 512, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_multicast", 
      "name": "vggatrousextractor2_normalize0_amp_multicast0", 
      "attrs": {"num_outputs": "2"}, 
      "inputs": [[78, 0, 0], [79, 0, 0]]
    }, 
    {
      "op": "broadcast_mul", 
      "name": "vggatrousextractor2_normalize0_broadcast_mul0", 
      "inputs": [[80, 0, 0], [80, 1, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor0_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"factor_type\": \"avg\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor0_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[83, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor0_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(24,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor0_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[85, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ssd_vgg160_convpredictor0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "24", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[82, 0, 0], [84, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ssd_vgg160_transpose0", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "ssd_vgg160_flatten0", 
      "inputs": [[88, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "vggatrousextractor2_pooling3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv10_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[90, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv10_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv10_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[92, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv10_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv10_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[94, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv10_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[91, 0, 0], [93, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu10_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[96, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv11_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv11_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv11_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[99, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv11_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv11_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv11_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[98, 0, 0], [100, 0, 0], [102, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu11_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv12_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[104, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv12_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv12_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[106, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_conv12_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_conv12_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[108, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_conv12_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[105, 0, 0], [107, 0, 0], [109, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_relu12_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[110, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "vggatrousextractor2_pooling4", 
      "attrs": {
        "kernel": "(3, 3)", 
        "pad": "(1, 1)", 
        "pool_type": "max", 
        "pooling_convention": "valid", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_dilated_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[112, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_dilated_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024, 512, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_dilated_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[114, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_dilated_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_dilated_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[116, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_dilated_conv0_fwd", 
      "attrs": {
        "dilate": "(6, 6)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(6, 6)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[113, 0, 0], [115, 0, 0], [117, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_dilated_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[118, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_dilated_conv1_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_dilated_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024, 1024, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_dilated_conv1_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_dilated_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(1024,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_dilated_conv1_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[123, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_dilated_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "1024", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [122, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_dilated_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor2_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor2_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"factor_type\": \"avg\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(36, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor2_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[128, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor2_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(36,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor2_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[130, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ssd_vgg160_convpredictor2_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "36", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[127, 0, 0], [129, 0, 0], [131, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ssd_vgg160_transpose1", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[132, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "ssd_vgg160_flatten1", 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra0_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[126, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra0_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra0_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[136, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra0_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra0_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[138, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_extra0_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[135, 0, 0], [137, 0, 0], [139, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_extra0_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[140, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra0_conv1_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra0_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra0_conv1_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra0_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(512,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra0_conv1_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[145, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_extra0_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "512", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[142, 0, 0], [144, 0, 0], [146, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_extra0_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[147, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor4_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor4_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"factor_type\": \"avg\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(36, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor4_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor4_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(36,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor4_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[152, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ssd_vgg160_convpredictor4_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "36", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[149, 0, 0], [151, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ssd_vgg160_transpose2", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[154, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "ssd_vgg160_flatten2", 
      "inputs": [[155, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra1_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[148, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra1_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra1_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra1_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra1_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[160, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_extra1_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[157, 0, 0], [159, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_extra1_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[162, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra1_conv1_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[163, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra1_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra1_conv1_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[165, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra1_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra1_conv1_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_extra1_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[164, 0, 0], [166, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_extra1_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[169, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor6_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor6_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"factor_type\": \"avg\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(36, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor6_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[172, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor6_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(36,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor6_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[174, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ssd_vgg160_convpredictor6_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "36", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[171, 0, 0], [173, 0, 0], [175, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ssd_vgg160_transpose3", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[176, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "ssd_vgg160_flatten3", 
      "inputs": [[177, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra2_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[170, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra2_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128, 0, 1, 1)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra2_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[180, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra2_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(128,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra2_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[182, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_extra2_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(1, 1)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[179, 0, 0], [181, 0, 0], [183, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_extra2_relu0_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[184, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra2_conv1_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra2_conv1_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"gaussian\", \"factor_type\": \"out\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra2_conv1_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[187, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "vggatrousextractor2_extra2_conv1_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(256,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra2_conv1_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[189, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "vggatrousextractor2_extra2_conv1_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[186, 0, 0], [188, 0, 0], [190, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "vggatrousextractor2_extra2_relu1_fwd", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor8_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[192, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor8_conv0_weight", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "[\"xavier\", {\"rnd_type\": \"uniform\", \"factor_type\": \"avg\", \"magnitude\": 3}]", 
        "__lr_mult__": "1.0", 
        "__shape__": "(36, 0, 3, 3)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor8_conv0_amp_cast1", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[194, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "ssd_vgg160_convpredictor8_conv0_bias", 
      "attrs": {
        "__dtype__": "0", 
        "__init__": "zeros", 
        "__lr_mult__": "1.0", 
        "__shape__": "(36,)", 
        "__storage_type__": "0", 
        "__wd_mult__": "1.0"
      }, 
      "inputs": []
    }, 
    {
      "op": "amp_cast", 
      "name": "ssd_vgg160_convpredictor8_conv0_amp_cast2", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[196, 0, 0]]
    }, 
    {
      "op": "Convolution", 
      "name": "ssd_vgg160_convpredictor8_conv0_fwd", 
      "attrs": {
        "dilate": "(1, 1)", 
        "kernel": "(3, 3)", 
        "layout": "NCHW", 
        "no_bias": "False", 
        "num_filter": "36", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[193, 0, 0], [195, 0, 0], [197, 0, 0]]
    }, 
    {
      "op": "transpose", 
      "name": "ssd_vgg160_transpose4", 
      "attrs": {"axes": "(0, 2, 3, 1)"}, 
      "inputs": [[198, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "ssd_vgg160_flatten4", 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "amp_cast", 
      "name": "vggatrousextractor2_extra3_conv0_amp_cast0", 
      "attrs": {"dtype": "float16"}, 
      "inputs": [[192, 0, 0]]
